import { LIFEFormat } from "../life";

export const dummyUser: LIFEFormat = {
    // 【利用者情報】
    "id": null,
    "名前": "",
    "ふりがな": "",
    "生年月日": { yyyy: "2024", mm: "04", dd: "22" },
    "保険者番号": null,
    "被保険者番号": null,
    "性別": "",

    // 【基本情報】
    "要介護度": "要介護1",
    "障害高齢者の日常生活自立度": "",
    "認知症高齢者の日常生活自立度": "",
    "評価日": { yyyy: "2024", mm: "04", dd: "22" },
    "評価時点": "サービス利用中",
    //【総論】
    "診断名": ["", "", ""],
    "緊急入院時の状況": [{
        "入院日": { yyyy: "2024", mm: "04", dd: "22" },
        "受療時の主訴": "",
        "その他": "",
    },
    {
        "入院日": { yyyy: "2024", mm: "04", dd: "22" },
        "受療時の主訴": "",
        "その他": "",
    },
    {
        "入院日": { yyyy: "2024", mm: "04", dd: "22" },
        "受療時の主訴": "",
        "その他": "",
    }],
    "服薬情報": [{ "薬剤名": "" }, { "薬剤名": "" }, { "薬剤名": "" }],
    // 家族
    "家族の状況": "",

    // ADL
    "食事": "",
    "椅子とベッド間の移乗": "",
    "整容": "",
    "トイレ動作": "",
    "入浴": "",
    "平地歩行": "",
    "階段昇降": "",
    "更衣": "",
    "排便コントロール": "",
    "排尿コントロール": "",
    "サービス利用終了理由": {
        "サービス利用終了日": { yyyy: "2024", mm: "04", dd: "22" },
        "終了理由": "",
        "その他": "",
    },

    //【口腔・栄養】
    "身長": "195.2",
    "体重": "95",
    "義歯の使用": "",
    "むせ": "",
    "歯の汚れ": "",
    "歯肉の腫れ出血": "",

    // 【認知症】
    "認知症の診断": {
        "診断名": "",
        "その他": "",
    },
    //【Vitality Index】
    "意思疎通": "",
    "起床": "",
    "排泄": "",
    "リハビリ": "",
}